# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
import pandas as pd
import numpy as np

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [15]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [16]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [17]:
# Your code here:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33183 non-null  object
 1   Job Titles         33183 non-null  object
 2   Department         33183 non-null  object
 3   Full or Part-Time  33183 non-null  object
 4   Salary or Hourly   33183 non-null  object
 5   Typical Hours      8022 non-null   float64
 6   Annual Salary      25161 non-null  float64
 7   Hourly Rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [24]:
# Your code here:
salaries['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [29]:
# Your code here:
salaries.groupby('Department')['Name'].count().sort_values(ascending=False)

Department
POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [34]:
dos = salaries[salaries['Salary or Hourly']=='Hourly']
dos.reset_index(inplace=True, drop=True)
dos.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
1,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
2,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
3,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
4,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

In [35]:
dos.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    8022.000000            0.0  8022.000000
mean       34.507604            NaN    32.788558
std         9.252077            NaN    12.112573
min        10.000000            NaN     2.650000
25%        20.000000            NaN    21.200000
50%        40.000000            NaN    35.600000
75%        40.000000            NaN    40.200000
max        40.000000            NaN   109.000000

H0 -->    mu = 30 

H1 -->    mu != 30

In [143]:
from scipy.stats import ttest_1samp

test = ttest_1samp(dos['Hourly Rate'], 30)
test.pvalue

4.3230240486229894e-92

In [144]:
umbral = 1-0.95
umbral

0.050000000000000044

In [145]:
if test.pvalue < umbral:
    print('We can reject H0')
else:
    print('We can not reject H0')

We can reject H0

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

H0 -->    mu >= 86000 

H1 -->    mu < 86000

In [146]:
dosdos = salaries[salaries['Department']=='POLICE']
dosdos.dropna(subset = ['Annual Salary'] , inplace=True)
dosdos.reset_index(inplace=True, drop=True)
dosdos.head()

<ipython-input-146-eb28224e4bcc>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dosdos.dropna(subset = ['Annual Salary'] , inplace=True)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
3,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
4,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [147]:
dosdos.describe()

       Typical Hours  Annual Salary  Hourly Rate
count            0.0   13404.000000          0.0
mean             NaN   86486.414503          NaN
std              NaN   18272.228294          NaN
min              NaN   38376.000000          NaN
25%              NaN   84054.000000          NaN
50%              NaN   90024.000000          NaN
75%              NaN   94524.000000          NaN
max              NaN  260004.000000          NaN

In [149]:
test = ttest_1samp(dosdos['Annual Salary'], 86000)
test

Ttest_1sampResult(statistic=3.081997005712994, pvalue=0.0020603403550965137)

In [150]:
test.pvalue/2

0.0010301701775482569

In [152]:
umbral = 1-0.95
umbral

0.050000000000000044

In [153]:
if test.pvalue/2 < umbral:
    print('We can reject H0')
else:
    print('We can not reject H0')

We can reject H0

Using the `crosstab` function, find the department that has the most hourly workers.

In [64]:
# Your code here:
pd.crosstab(salaries['Department'],salaries['Salary or Hourly'], 
            values=salaries['Name'],aggfunc='count').sort_values(by='Hourly', ascending = False).head(10)

Salary or Hourly  Hourly  Salary
Department
STREETS & SAN     1862.0   336.0
WATER MGMNT       1513.0   366.0
OEMC              1273.0   829.0
AVIATION          1082.0   547.0
GENERAL SERVICES   765.0   215.0
TRANSPORTN         725.0   415.0
PUBLIC LIBRARY     299.0   716.0
FAMILY & SUPPORT   287.0   328.0
CITY COUNCIL        64.0   347.0
FINANCE             44.0   516.0

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

H0--> mu<35

H1--> mu>35

In [78]:
dostres = salaries[salaries['Department']=='STREETS & SAN']
dostres.dropna(subset = ['Hourly Rate'] , inplace=True)
dostres.reset_index(drop=True,inplace=True)
dostres.head()

<ipython-input-78-ca91b9d166b5>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dostres.dropna(subset = ['Hourly Rate'] , inplace=True)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
1,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
2,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
3,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
4,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60

In [83]:
dostres.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    1862.000000            0.0  1862.000000
mean       37.137487            NaN    33.728378
std         8.777897            NaN     5.735242
min        10.000000            NaN    19.500000
25%        40.000000            NaN    35.600000
50%        40.000000            NaN    35.600000
75%        40.000000            NaN    36.210000
max        40.000000            NaN    53.100000

In [155]:
test = ttest_1samp(dostres['Hourly Rate'], 35)
test

Ttest_1sampResult(statistic=-9.567447887848152, pvalue=3.3378530564707717e-21)

In [156]:
test.pvalue

1.6689265282353859e-21

In [81]:
if test.pvalue < umbral:
    print('We can reject H0')
else:
    print('We can not reject H0')

We can reject H0

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [159]:
# Your code here:
from scipy.stats import t
from scipy import stats
mean_sample = salaries['Hourly Rate'].mean(skipna=True)
s_error = stats.sem(salaries['Hourly Rate'],nan_policy='omit')
t.interval(0.95, len(salaries['Hourly Rate'])-1, loc=mean_sample, scale=s_error)

(32.52348867934134, 33.05362675321912)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [160]:
# Your code here:
from scipy.stats import t
from scipy import stats
mean_sample = salaries['Annual Salary'].mean(skipna=True)
s_error = stats.sem(salaries['Annual Salary'],nan_policy='omit')
t.interval(0.95, len(salaries['Annual Salary'])-1, loc=mean_sample, scale=s_error)

(86526.99959172707, 87046.99998857579)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [170]:
# Your code here:
import numpy as np
from statsmodels.stats.proportion import proportions_ztest

z,p = proportions_ztest(salaries['Salary or Hourly'].value_counts()[1],len(salaries),0.25)

print(z,p)

-3.5099964213703005 0.0004481127249057967